{
    "playlists": {
        "PLVcB70hz-Vd2Hq3JBJOx-GpuYkM5a-cJv": {
            "url": "https://www.youtube.com/playlist?list=PLVcB70hz-Vd2Hq3JBJOx-GpuYkM5a-cJv",
            "videos": [
                {
                    "url": "https://www.youtube.com/watch?v=BJjsfNO5JTo",
                    "publishedAt": "2025-04-25T14:00:15Z",
                    "title": "How To Get The Most Out Of Vibe Coding | Startup School",
                    "description": "AI can't yet one-shot an entire product—but with the rise of vibe coding, it's getting close.    YC's Tom Blomfield has spent the last month building side projects with tools like Claude Code, Windsurf, and Aqua, seeing just how far you can push modern LLMs. From writing full-stack apps to debugging with a single paste of an error message, AI is becoming a legit collaborator in the dev process. This video is a playbook for anyone who wants to get the most out of vibe coding and build faster.  Apply to Y Combinator: https://ycombinator.com/apply Work at a startup: https:/workatastartup.com  Chapters (Powered by https://chapterme.co/) -  0:00 Intro 0:54 Some vibe coding tips from YC X25 founders 4:12 First, pick your tools and make a plan  6:27 Use version control  7:23 Write tests  8:14 Remember, LLM's aren't just for coding 8:57 Bug fixes 11:10 Documentation 12:03 Functionality  13:20 Choose the correct stack 15:08 Refactor frequently 15:40 Keep experimenting! 16:21 Outro",
                    "fed": false
                },
                {
                    "url": "https://www.youtube.com/watch?v=9CISphpvapI",
                    "publishedAt": "2025-07-01T14:09:57Z",
                    "title": "Linux Has A New Problem…",
                    "description": "Privilege escalations are some of the coolest vulnerabilities in hacking, and the most dangerous. Hackers can use these to bump their privileges to a dangerous level.  Go check out Flare at https://go.lowlevel.tv/flare and get ahead of cyber threats!  https://ubuntu.com/security/CVE-2025-6018 https://blog.qualys.com/vulnerabilities-threat-research/2025/06/17/qualys-tru-uncovers-chained-lpe-suse-15-pam-to-full-root-via-libblockdev-udisks  🏫 MY COURSES Sign-up for my FREE 3-Day C Course: https://lowlevel.academy  🧙‍♂️ HACK YOUR CAREER Wanna learn to hack? Join my new CTF platform: https://stacksmash.io  🔥COME HANG OUT    Check out my other stuff: https://lowlevel.tv",
                    "fed": true
                },
                {
                    "url": "https://www.youtube.com/watch?v=O2MR7ExW9tg",
                    "publishedAt": "2025-06-30T17:20:14Z",
                    "title": "Why I Build My Apps BACKWARDS Now",
                    "description": "I used to dread deployment—now I deploy first, build later, and everything just works. Try Sevalla and get $50 in free credits: https://sevalla.com  ⚡Multiple monitor dock - https://amzn.to/3rp4S8h ⚡My tiny OWC T4 Dock (no DisplayLink) - https://amzn.to/44F9UMR ⚡My favorite OWC Dock (no DisplayLink) - https://amzn.to/3OeEve8 ⚡My favorite knife - https://amzn.to/44FadY1  👀 *Other gear I use:* https://www.amazon.com/shop/alexziskind  ▶️ M2 MacBook Air | INSTANTLY connect 4K monitors - https://youtu.be/KLI65HnvNMg ▶️ INSANE Machine Learning on Neural Engine - https://youtu.be/Y2FOUg_jo7k ▶️ Ultimate Web Developer MacBook - https://youtu.be/72fneIUHXyY ▶️ This is what spending more on a MacBook Pro gets you - https://youtu.be/iLHrYuQjKPU ▶️ Apple M1 and Developers Playlist - https://youtube.com/playlist?list=PLPwbI_iIX3aR88msMh-cHoJiBqS6YMUUH Developer productivity Playlist - https://www.youtube.com/playlist?list=PLPwbI_iIX3aQCRdFGM7j4TY_7STfv2aXX  — — — — — — — — —   ❤️ SUBSCRIBE TO MY YOUTUBE CHANNEL 📺  Click here to subscribe: https://www.youtube.com/@AZisk?sub_confirmation=1  — — — — — — — — —  📱LET'S CONNECT ON SOCIAL MEDIA  ALEX ON TWITTER: https://twitter.com/digitalix  — — — — — — — — —  Join this channel to get access to perks: https://www.youtube.com/channel/UCajiMK_CY9icRhLepS8_3ug/join   #sevalla #vscode  #softwareengineer",
                    "fed": false
                },
                {
                    "url": "https://www.youtube.com/watch?v=_PioN-CpOP0",
                    "publishedAt": "2025-07-01T14:00:13Z",
                    "title": "Fei-Fei Li: Spatial Intelligence is the Next Frontier in AI",
                    "description": "A fireside with Dr. Fei-Fei Li on June 16, 2025 at AI Startup School in San Francisco.  Dr. Fei-Fei Li is often called the godmother of AI—and for good reason. Before the world had AI as we know it, she was helping build the foundation.  In this fireside, she recounts the creation of ImageNet, a project that helped ignite the deep learning revolution by providing the data backbone modern computer vision needed. She walks through the early belief in data-driven methods, the shock of seeing convolutional networks outperform expectations in 2012, and how those breakthroughs led to captioning, storytelling, and ultimately, generative models.  Now, she’s taking on one of AI’s hardest frontiers: spatial intelligence. Fei-Fei shares why modeling the 3D world is essential for AGI—and why it may be even more difficult than language.  Chapters: 00:08 - The Origins of ImageNet   02:15 - The Dream to Make Machines See 03:28 - A paradigm shift in AI 04:42 - The Breakthrough Year: AlexNet and Deep Learning   08:00 - Evolving Computer Vision 12:20 - Building World Labs 13:00 - The next frontier in AI 14:20 - Why Spatial Intelligence Is Harder Than Language 18:40 - Technical Barriers for Vision-Based AI 20:00 - AI is more than LLMs 24:19 - Real-World Applications of World Models   25:50 - Fei Fei’s Journey 29:30 - Mentoring some of the legends of AI 33:00 - Audience Q&A",
                    "fed": false
                },
                {
                    "url": "https://www.youtube.com/watch?v=oOylEw3tPQ8",
                    "publishedAt": "2025-06-11T14:01:18Z",
                    "title": "Cursor CEO: Going Beyond Code, Superintelligent AI Agents, And Why Taste Still Matters",
                    "description": "Michael Truell, co-founder and CEO of Anysphere, the company behind Cursor, joins Garry to talk about building one of the fastest-growing startups of all time—and why he's betting on a future beyond code. He walks through the early insights that led his team to leave a promising AI-powered CAD project and instead chase a bigger dream: reinventing how software is written.   From years of false starts and rewrites to Cursor's breakthrough moment, Michael explains what it takes to build a tool that could eventually replace programming as we know it. He also reflects on their first 10 hires, why taste still matters and how the decade ahead will unlock a new kind of creativity for builders everywhere.  Apply to Y Combinator: https://www.ycombinator.com/apply/ Work at a startup: https://www.ycombinator.com/jobs  Chapters (Powered by https://ChapterMe.co): 00:00 - Intro 01:00 - A new way to build software 02:00 - Cursor’s mission 03:40 - The downside of vibe coding 04:50 - Two ways to view LLMs 05:50 - Bottlenecks to superhuman agents 08:30 - New approaches to coding UI 09:40 - Why taste still matters 12:15 - Niche software opportunities 13:30 - Cursor origin story 16:00 - The first problem they tried solving 17:20 - Why they abandoned the CAD idea 21:00 - Pivoting to Cursor 23:00 - Following the scaling laws 24:30 - Early product decisions 25:20 - The GitHub Copilot origin story 27:00 - Getting to PMF 30:00 - “Dogfooding” 31:00 - First 10 hires 32:50 - How to evaluate great engineers in age of AI 33:45 - Maintaining the hacker mindset as you grow 35:00 - What are the moats for AI coding tools? 37:00 - Looking ahead",
                    "fed": false
                },
                {
                    "url": "https://www.youtube.com/watch?v=4VDZRR07Eqw",
                    "publishedAt": "2023-08-11T01:00:01Z",
                    "title": "How to Get Into Silicon Valley’s $600 Billion Startup School | The Circuit with Emily Chang",
                    "description": "Y Combinator is a famous Silicon Valley startup accelerator where Airbnb, Coinbase and Reddit all got their start. This startup school has backed companies now valued at $600 billion. Emily Chang met with Y Combinator CEO and President Garry Tan to discuss his roots as a founder who went through Y Combinator himself, to his return as the accelerator's current CEO. They discuss what it takes to be a great founder, the Silicon Valley Bank crisis, how Mr. Beast schooled Tan on his content creating, and the fate of San Francisco.   -------- Like this video? Subscribe: http://www.youtube.com/Bloomberg?sub_confirmation=1 Become a Quicktake Member for exclusive perks: http://www.youtube.com/bloomberg/join  Bloomberg Originals offers bold takes for curious minds on today’s biggest topics. Hosted by experts covering stories you haven’t seen and viewpoints you haven’t heard, you’ll discover cinematic, data-led shows that investigate the intersection of business and culture. Exploring every angle of climate change, technology, finance, sports and beyond, Bloomberg Originals is business as you’ve never seen it.   Subscribe for business news, but not as you've known it: exclusive interviews, fascinating profiles, data-driven analysis, and the latest in tech innovation from around the world.  Visit our partner channel Bloomberg Quicktake for global news and insight in an instant.",
                    "fed": false
                },
                {
                    "url": "https://www.youtube.com/watch?v=qVh4xvG1ltY",
                    "publishedAt": "2025-07-01T14:44:12Z",
                    "title": "Linux Can't Stop Winning",
                    "description": "Get 20% off Mobbin Pro to up your design game https://mobbin.com/bigboxswe  Linux simply can't stop winning   Tags You Can't Beat Linux, Linux Can't Stop Winning, Linux in Governments, Denmark off Linux, India Linux, USA Linux",
                    "fed": true,
                    "summary": "The video argues that Linux is experiencing significant growth and 'winning' in various sectors. It highlights Linux's increasing presence in gaming, primarily driven by the Steam Deck and Proton compatibility layer, which allows Windows games to run on Linux. It also points out major government shifts from Windows to Linux in countries like Denmark, France, and Germany, citing cost-effectiveness, data sovereignty, and freedom from proprietary restrictions as key reasons. Finally, the video emphasizes Linux's improved versatility and ease of use, with modern distributions being more user-friendly and hardware support from major companies increasing, making it an increasingly viable operating system choice for users.",
                    "usefulness_rating": "useful",
                    "actionable_points": [
                        "If interested in PC gaming, explore the Steam Deck or investigate using Proton on a Linux PC to play Windows games, checking compatibility on ProtonDB.",
                        "For those concerned about privacy, data sovereignty, or ads in their OS, consider migrating to a Linux distribution for personal use.",
                        "Research user-friendly Linux distributions like Linux Mint or Pop!_OS as a starting point, or more advanced options like Arch or Gentoo if seeking deeper customization.",
                        "Look into hardware manufacturers like System76, Framework, or Dell (XPS 13 line) that offer laptops with Linux pre-installed.",
                        "If involved in government or large organizational IT, consider the benefits of open-source solutions like Linux and LibreOffice for cost savings and data control, as demonstrated by examples in Denmark, France, and Germany."
                    ]
                },
                {
                    "url": "https://www.youtube.com/watch?v=gLnltsd1Ngs",
                    "publishedAt": "2025-02-15T12:28:33Z",
                    "title": "You are absolutely fluent in English if you can understand these",
                    "description": "🧑‍🏫💙 JOIN MY FLUENCY COURSE (£100 DISCOUNT): https://britishenglishfluency.carrd.co/  📚 FREE PDF: https://dylaneducation.co.uk/you-are-absolutely-fluent-in-english-if-you-can-understand-these/  0:00 If you can understand THIS... 2:05 Joke 1: The Mirror Factory 3:24 Joke 2: The Graveyard 4:40 Joke 3: The Mathematician 6:14 Joke 4: Doctor's Orders 7:50 Joke 5: Holiday Plans 9:01 Joke 6: My Accident 10:57 Joke 7: The Artist 13:04 BONUS - Can you get THIS impossible joke?? 14:38 2 More things...  If you can understand the jokes I am about to tell you in this video, then you are ABSOLUTELY fluent in British English!  Today, I will be showing you 7 jokes, and you need to see how many you can understand. This will not only test your English vocabulary, but also your core understand of British humour.  After each joke, I will also teach you new expressions / pieces of vocabulary.   This video will be a brilliant way to improve your everyday English vocabulary, idioms, and expressions, whilst helping you to understand fast, natural, everyday British English jokes!  Enjoy!  💌 WEEKLY NEWSLETTER (Exclusive Video): https://www.dylaneducation.co.uk/newsletter  🌟 Follow My Podcast (Spotify): https://open.spotify.com/show/3kklz6T1nhbBSrnns9sPG0?si=oaG8Ws8HRC6D-Q4yTTWfOA   🌍 My Instagram: https://www.instagram.com/britisheducation_/  😍 MY TIKTOK: https://www.tiktok.com/@britisheducation_  #britishaccent #britishenglish #esl #dailyenglish #learnenglish #modernrp  #englishexpressions #englishlistening #listeningpractice #englishjokes   -----------------------------------------------------------------  LAUGHTER SOUNDTRACK FULL CREDIT:  1) https://freesound.org/people/aarrnnoo/sounds/520370/ 2) https://freesound.org/people/aarrnnoo/sounds/520374/#dailyenglish   Ignore:  1) If you can understand THESE, then you're absolutely FLUENT in English* 2) Only FLUENT English speakers will laugh at these jokes 3) If you laugh, you're absolutely fluent in English 4) If you laugh, you're absolutely fluent in English (British Humour)***  // (British Jokes) 5) You are absolutely fluent in English if you can understand these** (17/2)",
                    "fed": false
                },
                {
                    "url": "https://www.youtube.com/watch?v=EWvNQjAaOHw",
                    "publishedAt": "2025-02-27T22:29:56Z",
                    "title": "How I use LLMs",
                    "description": "The example-driven, practical walkthrough of Large Language Models and their growing list of related features, as a new entry to my general audience series on LLMs. In this more practical followup, I take you through the many ways I use LLMs in my own life.  Chapters 00:00:00 Intro into the growing LLM ecosystem 00:02:54 ChatGPT interaction under the hood 00:13:12 Basic LLM interactions examples 00:18:03 Be aware of the model you're using, pricing tiers 00:22:54 Thinking models and when to use them 00:31:00 Tool use: internet search 00:42:04 Tool use: deep research 00:50:57 File uploads, adding documents to context 00:59:00 Tool use: python interpreter, messiness of the ecosystem 01:04:35 ChatGPT Advanced Data Analysis, figures, plots 01:09:00 Claude Artifacts, apps, diagrams 01:14:02 Cursor: Composer, writing code 01:22:28 Audio (Speech) Input/Output 01:27:37 Advanced Voice Mode aka true audio inside the model 01:37:09 NotebookLM, podcast generation 01:40:20 Image input, OCR 01:47:02 Image output, DALL-E, Ideogram, etc. 01:49:14 Video input, point and talk on app 01:52:23 Video output, Sora, Veo 2, etc etc. 01:53:29 ChatGPT memory, custom instructions 01:58:38 Custom GPTs 02:06:30 Summary  Links - Tiktokenizer https://tiktokenizer.vercel.app/ - OpenAI's ChatGPT https://chatgpt.com/ - Anthropic's Claude https://claude.ai/ - Google's Gemini https://gemini.google.com/ - xAI's Grok https://grok.com/ - Perplexity https://www.perplexity.ai/ - Google's NotebookLM https://notebooklm.google.com/ - Cursor https://www.cursor.com/ - Histories of Mysteries AI podcast on Spotify  https://open.spotify.com/show/3K4LRyMCP44kBbiOziwJjb  - The visualization UI I was using in the video: https://excalidraw.com/ - The specific file of Excalidraw we built up: https://drive.google.com/file/d/1DN3LU3MbKI00udxoS-W5ckCHq99V0Uqs/view?usp=sharing - Discord channel for Eureka Labs and this video: https://discord.gg/3zy8kqD9Cp  Educational Use Licensing This video is freely available for educational and internal training purposes. Educators, students, schools, universities, nonprofit institutions, businesses, and individual learners may use this content freely for lessons, courses, internal training, and learning activities, provided they do not engage in commercial resale, redistribution, external commercial use, or modify content to misrepresent its intent.",
                    "fed": false
                }
            ],
            "added_date": "2025-07-02T02:32:12.244796"
        }
    },
    "last_fed_date": "2025-07-02"
}